{
  "navbar": {
    "homeButton": "Home",
    "roomsButton": "Rooms",
    "locationButton": "Location",
    "hotelServicesButton": "Hotel Services",
    "contactUsButton": "Contact",
    "addressText": "Nah'alat Benyamin street 23, Tel Aviv-Yafo"
  },
  "hotelWelcome": {
    "sub-header-welcome": "the Tailor TLV",
    "sub-text-welcome": "Welcome to The Tailor Hotel, nestled on Nahalat Binyamin — one of Tel Aviv’s most vibrant and iconic streets. Our hotel offers a contemporary hospitality experience, thoughtfully designed and tailored to suit guests from Israel and around the world. Just like a tailor who crafts each garment with precision and care, we draw inspiration from the local spirit to create a stay that’s personal, stylish, and meticulously curated down to the last detail."
  },
  "homeShortAbout": {
    "shortAboutTitle": "ABOUT US",
    "shortAboutText": "short about text"
  },

  "homeRooms": {
    "roomsTitle": "ROOMS & SUITES",
    "roomsText": "The Tailor Hotel offers a unique hospitality experience with 29 beautifully designed rooms, including 2 luxurious suites. Each room is thoughtfully crafted, blending style, comfort, and functionality with precision. Many rooms overlook a vibrant urban landscape and offer breathtaking views of the Mediterranean Sea. All accommodations are equipped with top-tier modern amenities to ensure a comfortable, enelant, and truly unforgettable stay.",
    "roomsSideNote": "Check‑in is available from <1>12:00</1>. Check‑out is until <3>15:00</3>. The Tailor Hotel’s cancellation policy allows changes up to 48 hours prior to arrival.",
    "roomsIncludeText": "Our rooms included with",
    "roomsIncludeTextBed": "100% Cotton sheets",
    "roomsIncludeTextDesk": "Desk",
    "roomsIncludeTextTV": "Smart TV with satellite",
    "roomsIncludeTextCoffee": "Nespresso machine",
    "roomsIncludeTextSafeBox": "Safe box",
    "roomsIncludeTextMinibar": "Minibar",
    "roomsIncludeCosmetic": "Care & Comfort Products",
    "roomsIncludeTextItem2": "2"
  },
  "roomCardAll": {
    "subInfoPeople": "Up to 2 adults"
  },
  "roomCardEconomy": {
    "subTitle": "Economy Room",
    "description": "Intimate, cozy, and tastefully designed. The Economy Room is ideal for guests seeking a calm hideaway in the heart of the city, with refined décor, a comfortable double bed, and a warm Tel Aviv atmosphere.",
    "subInfoMeter": "14 m²"
  },
  "roomCardStandard": {
    "subTitle": "Standard Room",
    "description": "A refined, comfortable room with a plush double bed and a calm space to unwind after a lively day in the city. Perfect for couples or solo travelers seeking a balance of comfort, location, and atmosphere.",
    "subInfoMeter": "16 m²"
  },
  "roomCardSuperior": {
    "subTitle": "Superior Room",
    "description": "A stylishly designed room with refined furnishings and a modern bathroom. Enjoy a calm, comfortable stay in the heart of the city, complete with thoughtful touches that make all the difference.",
    "subInfoMeter": "18 m²"
  },
  "roomCardSuperiorBalcony": {
    "subTitle": "Superior Room with Balcony",
    "description": "All the comfort of a Superior room, plus a private balcony overlooking the vibrant, colorful Nahalat Binyamin boulevard. Perfect for guests who enjoy both the room and the city atmosphere.",
    "subInfoMeter": "18 m²"
  },
  "roomCardDeluxe": {
    "subTitle": "Deluxe Room",
    "description": "Spacious, elegant, and inviting with a refined boutique feel. The Deluxe room features curated furnishings, a cozy seating area, and a stylish bathroom—offering comfort and calm right in the heart of the city.",
    "subInfoMeter": "22 m²"
  },
  "roomCardDeluxeBalcony": {
    "subTitle": "Deluxe Room with Balcony",
    "description": "A room that blends calm with a charming urban view. The Deluxe Balcony offers generous space, refined design, and a private terrace overlooking the colorful, lively streets of Nahalat Binyamin.",
    "subInfoMeter": "22 m²"
  },
  "roomCardSuite": {
    "subTitle": "Suite with Balcony",
    "description": "Bright suites on the upper floors with a spacious balcony overlooking the Mediterranean and lively Nahalat Binyamin. Ideal for couples seeking a boutique experience.",
    "subInfoMeter": "21 m²"
  },
  "homeServices": {
    "homeServicesText": "Hotel Services",
    "homeServicesBreakfast": "Rich Israeli breakfast",
    "homeServicesReseption": "24-hour reception",
    "homeServicesInternet": "Free Wi-Fi throughout the hotel",
    "homeServicesHouseCleaning": "Daily cleaning / room service",
    "homeServicesLuggage": "Luggage room",
    "homeServicesLaundry": "Laundry and ironing service",
    "homeServicesRoomService": "Room Service",
    "homeServicesRooftop": "Rooftop with a city view"
  },
  "homeMap": {
    "sub-header-map": "The Center of Center TLV",
    "sub-text-map": "The Taylor is located on Nahalat Binyamin, one of Tel Aviv’s most vibrant and iconic streets, once known as a hub for textiles, markets, and local craftsmanship. Just a few steps from the colorful Carmel Market and surrounded by a rich variety of restaurants, bars, and beloved cafés, you’ll enjoy a lively urban atmosphere around the clock — right outside your door."
  },
  "footer": {
    "footerTitle": "The Tailor Hotel",
    "footerSectionLeftContactUsText": "Contact Us",
    "footerSectionLeftFollowUsText": "Follow Us",
    "footerSectionMiddleAttractionText": "Attraction",
    "footerSectionMiddleMediaText": "Media",
    "footerSectionMiddleSitemapText": "Sitemap",
    "footerSectionMiddleTermsAndConditionsText": "Terms and Conditions",
    "footerSectionRightWifiText": "Free WiFi at the hotel",
    "footerSectionRightAccessibilityText": "Accessibility",
    "footerSectionRightPrivacyPolicyText": "Privacy Policy",
    "footerSecuredWebsiteText": "Secured Website"
  },
  "accessibilityWidget": {
    "accessibilityWidgetTitle": "Accessibility Tools",
    "increaseText": "Increase Text",
    "decreaseText": "Decrease Text",
    "grayScale": "Grayscale",
    "highContrast": "High Contrast",
    "negativeContrast": "Negative Contrast",
    "lightBackground": "Light Background",
    "linkUnderline": "Link Underline",
    "readableFont": "Readable Font",
    "resetAll": "Reset All"
  },
  "accessibilityPage": {
    "pageTitle": "Accessibility at Tailor Hotel",
    "introText": "Tailor Hotel is committed to providing respectful, inclusive, and accessible service to all guests. In accordance with the Equal Rights for People with Disabilities Law (1998), we continuously invest in making our facilities and services accessible.",
    "buildingFeatures": [
      "Designated handicapped parking spaces near the entrance",
      "Accessible reception desk and service counters",
      "Wheelchair-accessible restrooms in the lobby",
      "Clear signage for navigation and identification",
      "Service animals are welcome throughout the property",
      "Staff assistance available for form completion and guidance"
    ],
    "sections": {
      "buildingTitle": "Building Accessibility",
      "websiteTitle": "Website Accessibility"
    },
    "features": {
      "keyboardNavigationTitle": "Keyboard Navigation",
      "keyboardNavigationContent": "All menus, links, and form controls are reachable via Tab, Shift+Tab, Enter; plus a “Skip to Content” link at the top of each page.",
      "semanticHtmlTitle": "Semantic HTML & ARIA",
      "semanticHtmlContent": "Proper use of <nav>, <main>, <header>, landmarks, and aria-labels/roles to describe interactive components.",
      "altTextTitle": "Alt Text & Media",
      "altTextContent": "Meaningful alt attributes on images; captions for videos; transcripts for audio.",
      "contrastTitle": "Color Contrast & Text Resize",
      "contrastContent": "Contrast ratio ≥ 4.5:1; supports zoom up to 200% without loss of content.",
      "responsiveTitle": "Responsive & Adaptive Layout",
      "responsiveContent": "Flexible grid and breakpoints ensure readability on all screen sizes.",
      "formLabelsTitle": "Form Labels & Error Handling",
      "formLabelsContent": "Each input has an associated <label>; errors announced via aria-live regions with clear fix instructions."
    },
    "contactText": "If you experience any barrier or issue, please email us at",
    "contactEmail": "hello@tailorhotel.com",
    "contactFollowUp": "— we’ll do our best to help or provide you an alternative format."
  },
  "termsPage": {
    "pageTitle": "Terms & Conditions",
    "introText": "These Terms & Conditions govern your use of Tailor Hotel’s website and services. By accessing or booking with us, you agree to the following terms:",
    "sections": [
      {
        "title": "Reservations & Payments",
        "items": [
          "All reservations are subject to availability and confirmation.",
          "Payment must be completed prior to check-in unless otherwise agreed.",
          "Cancellation policies vary by rate and season."
        ]
      },
      {
        "title": "Guest Responsibilities",
        "items": [
          "Guests must comply with hotel rules and respect other guests.",
          "Damage to property may result in additional charges."
        ]
      },
      {
        "title": "Privacy & Data",
        "paragraph": "We respect your privacy. Personal data collected during booking is handled in accordance with our privacy policy."
      }
    ]
  },
  "privacyPage": {
    "pageTitle": "Privacy Policy",
    "introText": "This Privacy Policy explains how we collect, use, and protect your personal data when you visit our website. By using our site, you agree to the practices described below, in accordance with GDPR and CCPA regulations.",
    "sections": [
      {
        "title": "Data Collection",
        "items": [
          "We collect non-personal data such as browser type, device info, and pages visited to improve site performance.",
          "Personal data (e.g., name, email) is only collected when you voluntarily submit it via forms or account registration.",
          "We do not collect sensitive personal data unless explicitly required and consented to."
        ]
      },
      {
        "title": "Legal Basis for Processing",
        "items": [
          "We process personal data based on your consent, contractual necessity, legal obligations, or legitimate interests.",
          "You may withdraw your consent at any time without affecting the lawfulness of prior processing."
        ]
      },
      {
        "title": "Cookies & Tracking",
        "items": [
          "We use cookies to remember preferences, analyze traffic, and improve user experience.",
          "Google Analytics tracks usage patterns anonymously.",
          "Meta Pixel helps us measure ad performance and retarget visitors.",
          "Tracking scripts are only activated after you accept cookies via our cookie drawer."
        ]
      },
      {
        "title": "Third-Party Services",
        "items": [
          "We use Google and Meta platforms for analytics and advertising insights.",
          "These services may store cookies or use similar technologies on your device.",
          "We do not sell personal data. We only share data when legally required or with your explicit consent."
        ]
      },
      {
        "title": "International Data Transfers",
        "items": [
          "Your data may be transferred to and processed in countries outside your jurisdiction.",
          "We implement appropriate safeguards to ensure your data is protected in accordance with applicable laws."
        ]
      },
      {
        "title": "Data Retention",
        "items": [
          "We retain personal data only as long as necessary for the purposes described or as required by law.",
          "Retention periods vary depending on the nature of the data and legal obligations."
        ]
      },
      {
        "title": "Your Rights",
        "items": [
          "You have the right to access, correct, delete, or restrict your personal data.",
          "You may request data portability or object to certain types of processing.",
          "California residents may opt out of the sale of personal information.",
          "To exercise these rights, contact us at: <strong>privacy@yourdomain.com</strong>"
        ]
      },
      {
        "title": "User Control",
        "items": [
          "You can accept or decline cookies via the cookie drawer on our site.",
          "Declining cookies disables tracking scripts and analytics tools.",
          "You may request deletion of any personal data you’ve submitted via contact forms."
        ]
      },
      {
        "title": "Policy Updates",
        "items": [
          "We may update this Privacy Policy periodically. Changes will be posted on this page with a revised date.",
          "We encourage you to review this policy regularly to stay informed."
        ]
      }
    ]
  },
  "notFoundPage": {
    "notFoundTitle": "404 - Page Not Found",
    "notFoundText": "The page you are looking for doesn't exist.",
    "goBackLinkText": "Go Back to Home Page"
  },
  "maintenancePage": {
    "maintenanceTitle": "🚧 Site Under Maintenance",
    "maintenanceText": "We're working hard to bring you something amazing. Please check back soon!"
  }
}
